---
layout: post
title: 管中窥豹无字书
description: 记录与分析2014年初至2017年底自己想读的书，借此分析自己这几年兴趣与志向的转变；有字之书好读，人生二十年匆匆过去，这个无字大书难读；好读难读，回首望去，关山难度。
category: blog
---

小时候喜欢读书，有书的话就很安静的读。

犹记得在小学，家里那边有个可以借书的地方，我几乎一天要去好几遍，书店很小，主人便给我做了限制，一天只能借一本书。因按照那种进度，不多久书店便可以读完了罢。

那时候是可以一天读好几本书的，现在不行了。一来那时候读的书比较易读，童年时间，通常都是些故事。现在也偶尔读故事，这一段时候读金庸的《鹿鼎记》，按照小时候天天夜夜读的进度是几天便可以读完的，但现在没有那么多时间了，这是个现实的问题。人生有些东西也分节气，过了这茬，心气就变了，童年的玩耍与阅读，少年的恋爱，莫不如是。

中学也读了好多书，中间也发生了许许多多的故事。无论好坏，都促成了今日的我吧，不能简单的说是好坏。但读书给了我一些买不到的东西是确定的，这东西简历上不能写，逢人不能说，颇有些意思。我须得感谢这二十年来读过的书，其中大多已经忘了，甚至说近乎所有都忘了，但是不察觉的时候偶尔可以讲出几句来，融于气血，得拿东西引出来。

长的就不说了，以后有机会慢慢说，今天就将豆瓣上标记的想读的书整理一下，看看哪些是仍然想读的，哪些又是自己瞎了眼的。想读的书和未读的书不同，假使以女子等书籍，一个想读的书便是一个想追求的女孩，未读之前可以让人遐想连篇，似乎有世上所有的优点。而读后，读通或不通，都有了一定的了解，有的便黯然了。而检索一遍这些书籍呢，也可以对自己的过去的大约三四年的时间的志向与趣味有一个定量的分析与总结，看看什么东西有了变化，兴趣有了转改。

这些书籍精确的书目是1191本，内容不羁，而且顺序书目极其零散，总结起来颇有难度，人说当局者迷，自己总结难免有些主观的情绪，而还有一句叫做解铃还许系铃人，只有我自己才能将这一本本书名牵连起来那时候的日子与欢欣吧。

话不多说，上正菜。

先给出这1191本想读的书的目录：
[想读的书](https://github.com/Huxingyu/Python_Learning/blob/master/some%20program/pro%202/想读的书.txt)。 
怎么分呢，这么多书，不如直接直接100本为一阶段，来一个十二阶段分析吧。每段配一与当时境遇相仿诗句，也有意思。

一，杨家有女初长成（2014.5-2014.9 ）
===
```md
遗失的智慧
习惯的力量
这个时代的无知与傲慢
当世界年轻的时候
在黑暗中绘画
科学碰撞“性”
沉思课
自由
隐藏的现实
趣味生活简史
人性分解
另一个欧洲
建筑师的20岁
Why We Love
宛如一部小说
好好讲道理
厨房里的人类学家
汪曾祺谈吃
论自由
个人知识
复杂思想:自觉的科学
错不在我
把时间当作朋友
翻转课堂的可汗学院
改变，从心开始
认知盈余
游戏改变世界
The Sense of Style
第56号教室的奇迹
第3选择
反景入深林
场所优势
世界的重新创造
大师的背影
反直觉思考
改变
黑天鹅
反脆弱
哲学的慰藉
哲学的邀请
哲学与人生
哲学的故事（上下）
裸女
Poor Economics
How to Make Love Like a Porn Star
书店传奇（平装本）
反映的实践者
HBR's 10 Must Reads on Managing Yourself
亲密关系
经验的疆界
从牛顿、达尔文到巴菲特
航海图
火鳳燎原 1
守望者 上
菊与刀
长日留痕
禅与摩托车维修艺术
自然哲学的数学原理
阅读的狩猎
人情与面子
社会认同过程
象与骑象人
默克家庭诊疗手册
幸福的真意
黑客与画家
不确定状况下的判断
社会表征
北回归线
南回归线
美国创新史
时代的噪音:从迪伦到U2的抵抗之声
健全的社会
自然辩证法
科学革命的结构
维特根斯坦传
追寻生命的意义
有生之年非听不可的1001张唱片
看见成长的自己
听音乐（插图第6版）
投资银行、对冲基金和私募股权投资
如何看一幅画
中国人的思维危机
The Porn Trap
图说中国绘画史
1984
这书能让你戒烟
少有人走的路
我执
我爱上了一个女孩
美好百科：这个知识点超纲了
Advice to a Young Scientist
Breaking Out
Explaining Creativity
The Bases of Competence
专注的快乐
What Every Man Thinks about Apart from Sex
Merriam-Webster's Vocabulary Builder
Getting More
自深深处
Give and Take
How to Become a Straight-A Student
```
这个时期是对应高中时候的不成熟的思考，盲目的阅读一些现代化的著作，而不懂得批判接收的状态，少年初长成，而无人指引，遂以至此；另外是没有好的品味，只知道一些大路边的东西，现在看一些书看起来毫无价值，甚至引起我反感。

二，五十年来，总成一梦 （2014.9-2015.10 ）
===
```md
艺术的力量
电影美学与心理学
古今名人读书法
赖世雄美语从头学（初级篇.上）
英语魔法师之语法俱乐部
把你的英语用起来！
经济学的思维方式（修订第12版）
数学、科学和认识论
笨办法学Python
编程匠艺
创变者
网络科学
Structure and Interpretation of Computer Programs - 2nd Edition (MIT)
陶庵梦忆 西湖梦寻
几何原本
Б.П.吉米多维奇数学分析习题集题解(1)(第三版)
深入理解计算机系统（原书第2版）
大停滞?
电子信息工程专业英语教程
数学指南
电子信息技术导论
高级宏观经济学导论
计算机数学基础 (平装)
怎样解题
Learn Python the Hard Way
The Joy of x
哈佛书架
Mind Hacks
Willpower
我在哈佛的最后一堂课
追求卓越
从优秀到卓越
计算机程序的构造和解释
深入理解计算机系统
激情澎湃
师从天才
二十世纪思想史年表
论人生
沉思录
滚雪球
查理·芒格传
乔纳森传
史蒂夫·乔布斯传
金钱有术
围城
科学与宗教的对话
Mathematical Puzzles
权力
古今数学思想（一）
高中数学题根
价值投资
沸腾的岁月
新金融大师
决策与判断
系统化思维导论（银年纪念版）
控制论与科学方法论
追风筝的人
红拂夜奔
野性的呼唤
狂热分子
了不起的盖茨比
喧哗与骚动
追忆似水年华
在人间
战争与和平（全四册）
Business Adventures
文学理论
巨人三传
傅雷家书
Python基础教程（第2版•修订版）
别闹了，费曼先生
生命的思索：史怀哲自传
如何高效学习
学习之道（第2版）
编码的奥秘
创新算法
理想国
月亮和六便士
浮士德
大卫·科波菲尔（上下）
文言津逮
天路历程
麦田里的守望者
九故事
完美伴侣
人间词话
影响力
数学之美
浪潮之巅
启示录
重来
简约至上
精益创业
格雷厄姆
历史学家的经线
中国文化的深层结构
心是孤独的猎手
余光中散文
安静
选择的悖论
```
段词语出《陶庵梦忆序》。看到这里不禁戚戚然，这时候大概是萌生了要在理工做事的念头，几本计科的书看起来很刺眼，那时候便知晓这些书了，也终于无所痕迹；这个时期是高考前后，考的极差不提了，也终是一个遗憾；上个时期的问题--尤其是对于社科的书籍品味把握--水平有点低。

三，恰同学少年 （2015.10-2015.12）
===
```md
开箱整理我的藏书
中国近代思想与学术的系谱
当代中国人精神生活研究
当代的精神处境
当代中国社会流动
当代中国社会阶层研究报告
人类行为与社会环境
丑陋的中国人
中国人的焦虑从哪里来
肌肉健美训练图解
跑步时该如何呼吸
且将生活一饮而尽
万万没想到
夜话港乐2
万物：创世
Foundations of Analog and Digital Electronic Circuits (The Morgan Kaufmann Series in Computer Architecture and Design)
郑渊洁童话全集(33卷)
文言津逮
查令十字街84号
Elon Musk
大路
信任的假象
当音乐停止之后
Information Theory, Inference and Learning Algorithms
信息论、推理与学习算法
三体X
Birth of a Theorem
中国古代房内考
爱的艺术
King, Warrior, Magician, Lover
托尔斯泰与陀思妥耶夫斯基（上下）
陀思妥耶夫斯基的世界观
权力的毛细管作用
Who Gets What — and Why
The Shape of the New
Choose Yourself!
城中城
Mindset
Thing Explainer
Algebraic Topology
Empire of Cotton
Ghettoside
吴清源对局全集（全四卷）
The Destruction of the Medieval Chinese Aristocracy
黑客帝国与哲学
稀缺
理性、真理与历史
槽边往事
无穷的开始
世界电影史（第二版）
从一元一次方程到伽罗瓦理论
万物既伟大又渺小
咖啡学
读史阅世六十年
The Oxford Companion to Wine, 3rd Edition
Fates and Furies
秦崩
鲁迅读过的书
胡适藏书目录
中国近三百年学术史（新校本）
等鹿来
汪曾祺自选集
知中·山水
西南联大国文课
巴黎评论·作家访谈Ⅰ
启功给你讲书法
设计中的设计
The Historical Development of the Calculus
数学分析中的典型问题与方法
既见君子
Thinking Architecture, 2nd Edition
Thinking, Fast and Slow
Asking the Right Questions
学会提问
八百万零一种死法
爱在黎明破晓前&爱在日落黄昏时
Calculus Concepts and Contexts (United States Military Academy Version)
Calculus Early Transcendentals 5th Ed with CD (Calculus Early Transcendentals 5e (CD included))
动机与人格
Thomas' Calculus
Calculus (Stewart's Calculus Series)
Pattern Recognition and Machine Learning
我看见的你是我自己
微积分教程（上）
Introduction to Linear Algebra, Fourth Edition
吾国与吾民
异乡人
乡土中国
巨富
知识与权力
工业4.0
TED演讲的秘密
当我们阅读时，我们看到了什么
叫魂
经济学原理
托马斯微积分
数学分析习题集
微积分学教程（第一卷）
跨界
中国，被遗忘的盟友
```
这个阶段的taste有了明显的提升，不得不说是一件极好的事情，做人做事，没有一点风格是不行的，至少在我这里不行，这是它的诞生的时候；初入大学，很关注社会的一些现象，对它们也进行了较浅的思考，这是很好的；这段时间功课很努力，但是不得不说效果是不太好的，是视野太差了，今天看来。

四，Cogito, ergo sum （2015.12-2016.1）
===
```md
Go Set a Watchman
上海字记
匠人
在紫禁城
温·婉
清华大学时代论坛
清华大学时代论坛  溯源讲堂（第一辑）
清华大学时代论坛  艺境文心（第一辑）
在北大听讲座-(1-16辑)
在北大听讲座（第1辑）
在细雨中呼喊
The Scientific American Book of Love, Sex and the Brain
旅行的異義
决策的智慧
民国价格史
胡适来往书信选（上）
海伯利安
科学的极致：漫谈人工智能
过于喧嚣的孤独
Reinventing Discovery
打破自我的标签
愚昧者的愚昧
连接组：造就独一无二的你
疊韻
如何独处
山屋憶往
無法送達的遺書
长物
红太阳
耶路撒冷三千年
松风
人在纽约
我见
我已与一万亿株白桦相逢
吉尔莫·德尔·托罗的奇思妙想
纸上中洲
胡金铨武侠电影作法
必然
天才的编辑
财富之城
何为良好生活
大灭绝时代
文明之光 （第三册）
海风中失落的血色馈赠
重读
月光落在左手上
你今天真好看
火星救援
Fahrenheit 451
诺贝尔的囚徒
百年斯文
二重奏
镜子
遗失在西方的中国史
代数学引论（第1卷）
Arbitrage Theory in Continuous Time
The  C Programming Language
数学分析（第一卷）
数学分析（第一册）
Principles of Neural Science, Fourth Edition
直观几何（上册）
现代几何学:方法与应用:第一卷:几何曲面、变换群与场
离散数学及其应用（原书第5版）
高等数学引论（第一册）
反欺骗的艺术
谁在银闪闪的地方，等你
高观点下的初等数学
信息简史
定性与半定量物理学
二十位人性见证者
All the Mathematics You Missed
Merriam-Webster's Vocabulary Builder
经济学通识
天鹅绒监狱
费恩曼物理学讲义（第1卷）
豹
中国史学史
中国史学史讲义稿
1800年以来的中英碰撞
学府与政府
苏珊·桑塔格谈话录
历史学人01：“强盗”资本家？
知日·写真
了解女人
蓝山
哈扎尔辞典（阴本）
哈扎尔辞典（阳本）
诗经译注
继承者们
论人类不平等的起源和基础
奇点临近
数学指南
草木缘情
怎样做理论
话语研究：多学科导论
本书书名无法描述本书内容
亲密关系的秘密
Orange'S:一个操作系统的实现
穿越计算机的迷雾
Learn More, Study Less
```
这几个月可以说是有极大的信息在我身边汇聚，那时候的我没有能力有洞彻这些信息，只能进行浅尝辄止的思考；但没有之前幼稚的思考，便不会现在较为系统的思考，故这段时间我思故我在，虽说这种存在还很稚嫩。

五，渺沧海之一粟 （2016.1-2016.2）
===
```md
好绘本如何好
如何阅读一本书
The Chinese Communist Party's Capacity to Rule
东方主义
巴黎神话
大师讲述历史中的20个大问题
中国史学史
格伦·古尔德谈话录
论摄影
Herodotus and Sima Qian
激荡三十年（下）
激荡三十年（上）
激荡三十年
中国大历史
你一定爱读的极简欧洲史
经典力学的数学方法
经典力学的数学方法
从微积分到上同调 (平装)
与神对话（第一卷）
庄子说
塞莱斯廷预言
实用微积分
常微分方程教程
微分方程、动力系统与混沌导论
高等微积分
线性代数应该这样学
运算放大器权威指南
伟大的博弈
通往智慧之路
The Oxford Companion to Philosophy
玛士撒拉之子
China and Islam
自私的皮球
The Elements of Style, Fourth Edition
An Introduction to Literary Chinese
物语三千：复活平民的历史
东方历史评论（第4辑）
讲谈社·中国的历史（十卷本）
断臂上的花朵
耳语者
無印良品的四季食谱
城塞
如何变得有思想
历史地理学读本
历史学的境界
政治秩序与政治衰败
大唐李白·将进酒
莎士比亚
段祺瑞政权
现象
中国精品新传
千面英雄
杜尚与/或/在中国
算法的乐趣
明朝那些事儿
计算流体力学入门
大师之声·第一卷
The Son Also Rises
疯狂实验史 II
Calculus With Analytic Geometry
赤脚医生万泉和
人类学通论
智识分子
2012中国精选餐厅指南
从卡夫卡到昆德拉
你会杀死那个胖子吗？
低智商社会
胡荣华说斗地主
斗地主形式判断与信号
算法：C语言实现
艺术的共谋
模拟集成电路设计精粹
Introduction to Algorithms
线性代数
线性代数
鹤唳华亭
陶哲轩实分析
Cracking the Coding Interview, Fourth Edition
An Introduction to Quantum Field Theory
力学
Lens·视觉004：需要什么，年轻的身体便去找寻
The Rise and Fall of the Third Reich
Dream Makers
How Not to Be Wrong
The Essential Hayek
Logicomix
天香
企鹅75
唯有悲伤不撒谎
死于荣耀之夜
常微分方程
电子设计从零开始
电路原理导学导教及习题解答
电路基础
电子电路原理
工程电路分析基础
CMOS Analog Circuit Design
Design of Analog CMOS Integrated Circuits
模拟和数字电子电路基础
大师
```
随着专业课程的到来，在一些地方进行了专业化的阅读，不过这对于整体的电子信息工程的学习是很浅的，但是这也是入门的必须；其他的地方有一些较为深入的阅读，这是好事，但是现在还没有意识到学科的广而深刻的性质，这也是不久前才认识到的。

六，非谓有大楼之谓也 （2016.2-2016.2）
===
```md
玩转魔方
哈农钢琴练指法
拜厄钢琴基本教程
回归大学之道
大学之道
中国大学1895-1995
大学精神档案(当代卷)
欧洲大学史（第一卷）
胡适选专业
大学何为
哈佛琐记
一个大学校长的自白
与本科生谈：论文与治学
大学之理念
大学之理念
十九札
失去灵魂的卓越
国立西南联合大学校史
哈佛通识教育红皮书
东方历史评论（第1辑）
天南
Lens·目客001:花朵与我
Lens·视觉001：激情藏在安静的角落
我们·逆行
单向街 001
单读11：联结/断裂
大宇宙
九州志
独唱团（第一辑）
人间世
放映 001
最後的貴族
短歌集：关于爱、梦境和旅途
特权
Imagined Sovereignties
The Book of Dead Philosophers
先生
为学术的一生
重读大师：一种谎言的真诚说法
清华四大导师
绘画大师的心灵世界
那些有意思的老头儿
给大师定位
创作大师
大师的盛宴
文坛亦江湖
线性代数
民国清流1
季羡林谈人生
清华的大师们
思想的盛宴
思想者
思想者说
大师笔下的大师
建筑大师MOOK丛书
北大学者谈读书
清华园日记
精英的聚会
走进大师
阅读的危险
1933，聆听民国
民国的底气
民国语文
辜鸿铭文集(上下)
中国文学史话
天才的故事-房龙论人
师从天才
天才引导的历程
卡什肖像经典
诗魂数学家的沉思
Annals of Mathematics
天遇
Problems in Mathematical Analysis (Pure and Applied Mathematics)
数学分析解题指南
南海十三郎
棋与人生
数学桥
伤花怒放
词家有道
逻辑学导论
Y
潮骚
生於天橋底
曾经
Cyberbullies, Cyberactivists, Cyberpredators
抄工与学者
我的凉山兄弟
天外有天
迷人的材料
Masculinities in Chinese History
美国企业家
中国创投20年
民主的细节
葛传椝英语写作
After Beethoven
唐诗开卷
卡萨诺瓦是个书痴
读库0601
灰皮书，黄皮书
1978-2008私人阅读史
```
这是大学第一个寒假，我竟然闲的在其中标记了接近两三百本书，真是闲的有些蛋疼；看书名是对中国的一些教育展开了一定的思考，当时我对自己提出的以点至面成体系对一个问题的阅读，现在看来还是很实在的，也是一个学者对一个问题进行思考与判断的最常见的方法。

七，东临碣石，以观沧海 （2016.2-2016.2）
===
```md
哥伦比亚的倒影
素履之往
虚拟书评
闲话读书
闲话闲说
写在人生边上
听良心的鼓声能走多远
自由风格
未来光锥
钱钟书:爱智者的逍遥
真精神  旧途径
胡适谈读书
杨振宁谈读书与治学
吕思勉谈读书治学
朱光潜谈读书
季羡林谈读书治学
莎士比亚、牛顿和贝多芬
失落的一代
20世纪的书
我们应有的反思
弱水三千
存在与荒谬
细说民国大文人
别想摆脱书
近二十年文化热点人物述评
书读完了
知我者謂我心憂
从黎明到衰落（上下）
信睿
中国人的家当
现场
编程之魂
逻辑新引・怎样判别是非
粘住
给青年诗人的信
给青年的十二封信
知识分子都到哪里去了
知识分子论
最迷人的数学趣题
为什么大猩猩比专家高明
为什么读经典
大问题
娱乐至死
朝话
推理的迷宫
拆掉思维里的墙
你干吗在乎别人怎么想？
谋生之道
一头想要被吃掉的猪
穷查理宝典
六顶思考帽
比知识还多
人生十八局
人生十论
周国平人生哲思录
系统思考
超越自卑
像艺术家一样思考
思考的技术
超越感觉
别做正常的傻瓜
读书的艺术
Thought Reform and the Psychology of Totalism
广州火车站的日与夜
獨立評論（全十卷）
思想的力量：智识之旅的非常规自传
问道者
半生为人
价值的理由
旧山河
经济学思想史进阶讲义
盗梦空间
两晋南北朝十二讲
诺贝尔之路
论经济学方法
经济学
百年中国经济史笔记
经济学的思维方式（第11版）
音乐札记
偶然
“穷“归故里
中国农民肖像：九亿人民的故事
中國女工
街头文化
中国式看守所
黑夜给了我黑色的眼睛
乡痛，在城市的深处
残影
四面墙
中国震撼世界
野心時代
十四家
经济学讲义（上）
论经济学和经济学家
Araki
多外语学习的语言习得原理、认知规律及学习方法研究
日子里的中国
日本历史教科书中的中国
一个村庄里的中国
从马克思到凯恩斯
```
第一个寒假还没有结束，我大约又涉猎了治学、社会问题、藏书这几个感兴趣的方向；不得不说这个假期对我还是十分重要的，我虽然想不到发生了什么事情，但是它对我的一生产生了潜移默化的影响。

八，世事洞明皆学问 （2016.2-2016.4）
===
```md
平面几何中的小花
数学竞赛研究教程（上下）
近代欧氏几何学
51单片机应用从零开始
时间触发嵌入式系统设计模式
新概念51单片机C语言教程
程序员的思维修炼
来自圣经的证明
流形上的微积分(双语版)
算法
Introduction to Complex Networks
物理学原理在工程技术中的应用
复杂网络理论及其应用
复杂网络
我和我:西川集(1985-2012)
微分方程的理论及其解法
微分几何入门与广义相对论（上册·第二版）
从零学相对论
力学
现代学人与学术
思辨随笔
政治是每个人的副业
思想人
C++ Primer 中文版（第 4 版）
C++程序设计语言
C++语言程序设计
那些電影教我的事
好读书
明日风尚2007年10月
无轨列车
文章皆岁月
纵议院之中国格局
西海岸，东海岸
令你苦思冥想的数学趣题
Patience and Fortitude
文雅的疯狂
极端的年代：1914～1991
帝国的年代：1875～1914
资本的年代：1848～1875
革命的年代：1789～1848
藏书家
藏书之爱
私人藏书
安珀志·下卷(6-10)(套装共5册)
冰与火之歌（卷一）
阅读的故事
一日一善（全4册）
垂直的阅读
胡同
性別中國
光影之痕
光影之隙
光影之忆
青春
爽
Weapons of the Weak
乌托有个帮
文化与人生
玫瑰之名
二十六篇
索尔·贝娄访谈录
我不是好学生
济南的冬天
Origins of the Modern Chinese State
The Death of Woman Wang
生活而已
魔方的科学和计算机表现
纯粹理性批判
判断力批判
实践理性批判
纯粹理性批判
活着
再见乌托邦
算命
与电影一起私奔
非常罪 非常美（增订版）
柴静×刘瑜：自由从何而来（中国故事）
莎士比亚密码
达·芬奇密码
清明上河图密码
中国文化要义
安持人物琐忆
构建之法
我与地坛
鲁迅活着
时代及其文学的敌人
杂书过眼录
逝去的年代
锵锵三人行·文化圈
不许联想
书斋里的革命
笑忘书
伍尔夫读书随笔
拉斯金读书随笔
王尔德读书随笔
罗曼·罗兰读书随笔
劳伦斯读书随笔
托尔斯泰读书随笔
毛姆读书随笔
```
这一阶段我还没有完全摆脱靠别人推荐或者提及来寻找书籍，扩大来说寻找进入一个学科或者方向的方法，在书籍的选择上良莠不齐；此外明显发现自己从文史到理工科学书籍的转变，也是随着课程在一步步深入吧。

九，君子不器 （2016.4-2016.12）
===
```md
发现社会
且借纸遁
解析几何 (修订本)
容忍与自由
夜色人生
Microeconomic Theory
自由风格
竹久梦二：画与诗
文献检索与利用
金圣叹选批才子必读书
风险、不确定性和利润
Algorithms + Data Structures = Programs
Europe since 1989
科技之巅
送你一颗子弹
萨特文集（全三册）
源泉
献给阿尔吉侬的花束
永恒的终结
来自新世界 （上下）
海伯利安
夏日遇见狄更斯
山海经校注（最终修订版）
四叠半神话大系
魔法活船3·命运之船（上下）
地海传奇1：地海巫师
时光之轮11·迷梦之刃（上下）
西岸三部曲1·天賦之子
迷雾之子1·最后帝国（上下册）
托勒密门扉
光明王
渡鸦之影1·血歌（上下）
第一律法 [卷一]
安珀志1：安珀九王子
魔戒
S.
维特根斯坦
文心
Y染色体与东亚族群演化
曾经沧海--一出漂浮的歌剧
十方一念
十二幅地图中的世界史
老码识途
冰与火之歌
设计原本
人月神话
普林斯顿数学指南（第一卷）
指弹吉他完整教程
旷世奇才
艺术哲学
克莱默夫妇
人生一瞬
内心的噪音
一个定理的诞生
圣传画集
Mathematics for Computer Science
昨日书
体验引擎
高级英文理解与表达教程
China's Second Continent
模拟电子技术基础
说部之乱
The Art of Computer Programming, Volumes 1-3 Boxed Set
Open Source Intelligence Techniques
爱因斯坦的梦
两种文化
罪恶之城：艰难告别
魔兽世界编年史
从大学数学走向现代数学
枪，偶尔有音乐
Problem Solving with Algorithms and Data Structures Using Python
Principles of Computer System Design
战俘营回忆录：1680天
数学物理方法 I
物理学中的群论
地下城与勇士典藏画册
Religio Medici
Quantum Fields and Strings
电动力学导论
统计物理学（第二版）
统计物理学
世界之战
思维的形状
杀敌算法
美国众神
数学物理方程与特殊函数
电磁学
大学物理学（第一册）
电子电路的计算机辅助分析与设计方法
首富沉思录
数学分析中的典型问题与方法
数理逻辑与集合论
21世纪中国文化地图
摇滚梦寻
图论与代数结构
程序设计导引及在线实践
Miklos Schweitzer Competitions
天意
英语听力入门3000
如何阅读一本文学书
```
君子不器是我非常喜欢的一句话，做人做学问，不应该死板、不兼容，君子世上太少了，我也不想做到，不器倒是情愿；明显放假了就放空自己，理工回文史，回忆起来是很美好的一段时光。

十，衣带渐宽终不悔 （2016.10-2017.4）
===
```md
缺失的一环
先知中国
诗书继世长
人物百一录
读书为上
古典的回声
四书道贯
三十年细说从头
尤利西斯
中国文学批评史大纲（校补本）
往来以礼
茶墨相（精装水墨版）
桑榆忆往
钱边缀琐
佛书料简
纵心所欲
拾贝集
在灵泊深处
永痕
榆斋弦音
存在与时间
当图书进入战争
忽必烈的挑战
书砦梁山泊
蒐书记
汪曾祺书画
秦风图文笔记
白先勇細說紅樓夢
我的朋友堂吉诃德
闲堂书简
顽石的风流
照夜白
西域的美人时代
金庸识小录
文津识小录
《三国志》讲义
喝酒的故事
有书和没书的日子
东鳞西爪集
上帝与黄金
蓝调城南
知中·民谣啊民谣
中国现代文学编年史
积木书
乱象丛生
反抗“平庸之恶”
近代中国的知识分子与文明
秦谜
名山
昨夜西风凋碧树
回首残阳已含山
水浒人物
营造天书
宋淇傳奇
燕山夜话
一个特立独行的人
一样花开
竹林引幻
现代主义
迷楼
鹿鼎记
竹简学
大学的精神
郋园读书志
猫
失落的优雅
历史的再思考
以赛亚·伯林书信集
纽顿藏书目录
如果没有今天，明天会不会有昨天？
全球史中的文化中国
斯飞日历2017
Small Groups and Political Rituals in China
爬出窗外并消失的百岁老人
北平杂记
2084
读通鉴论（上中下册）
旋量代数与李群、李代数
叙事的转向
只有大众，没有文化
生活的艺术
有鹿来
波峰与波谷
分析哲学导论
20世纪数学经纬
The Monster That Is History
易堂寻踪
记忆小屋
社会学的邀请
江湖丛谈
棋王.樹王.孩子王
梦战
集部论稿初编
通信之道——从微积分到5G
权力运行的轨迹
创新的洞见
巨流河
田园诗与狂想曲
文字即垃圾：危机之后的文学
生于一九八四
```
这段时间不得不说很痛苦，感情上巨大的不可弥合的缺口让人崩溃，煎熬应如是也；没有心思去学习与工作，直到那个世界坍塌；但回首，依然说一句衣带渐宽终不悔，遗憾多，再来一遍也会如此吧；但是这一段时间对于学科与知识的探索做的比较差，几乎停步；而我现在做的一些事便是弥补，与其说苟活下来了，不如说涅槃，兼而有之吧，感情哪有是非。

十一，也无风雨也无晴 （2017.4-2017.7）
===
```md
秦汉帝国
被仰望与被遗忘的
鲁迅日记（全三册）
如何读中国画
能静居日记（全四册）
榆下说书
我在拍電影時思考的事
紅色工程師的崛起
银河帝国：基地七部曲
当代民谣中的那些事
电磁学
程序员的自我修养
ARM嵌入式系统开发
交流的无奈
编写高质量代码：改善Python程序的91个建议
Python编程快速上手
Python金融大数据分析
实用数学手册
汇编语言（第2版）
疑之颂
幽灵
最后的游牧帝国
银河映像，难以想像
J.S.巴赫创意曲
巴赫创意曲集
江浙财阀与国民政府（一九二七——一九三七年）
番石榴飘香
译文
大话移动通信
我的精神家园
红雨
中国邪教史
大失败
管锥编（全五册）
无眠在世纪末
郁达夫新论
维稳的政治逻辑
皇帝新脑
甜与权力
俄罗斯的命运
目录学发微 古书通例
马桥词典
争夺欧洲霸权的斗争
清代诗文集汇编总目录·索引
建筑技术科学（建筑物理）书目索引
文物五OO期总目索引(1950.1-1998.1)
俄罗斯文学讲稿
我看金庸小说
珠还记幸
笔祸史谈丛
神经症与人性的成长
The Rhetoric of Mao Zedong
夜读抄
杨度与梁启超
冰雪王国
小岛经济学
春之祭
人情之美
中式英语之鉴
Structure and Interpretation of Signals and Systems
湮没的辉煌
藏園群書經眼錄（全四冊）
北京法源寺
东亚近代文明史上的梁启超
东至周氏家传
周学熙自述
得书记
弄潮兒
步履不停
嘉峪關外
时间的玫瑰
学堂乐歌考源
唐朝定居指南
唐代政治史略稿
初学记（上下册）
街头的狂欢
逝年如水
猫国物语
四库全书总目 全两册
锦绣万花谷
死亡地图
再创世纪
地图之上
岁月书香（一集）
论孔丘
七杀简史
处男葛不垒
信号与系统结构精析
童年的秘密
I Am Maru
人物往来与书籍流转
信号与系统计算机练习
信号与系统
Linux C编程一站式学习
树莓派学习指南
醉酒的植物学家
山东叛乱
世界的凛冬
儒学的经济学解释
艺术史中的汉晋与唐宋之变
```
一起都在慢慢复苏，这一段时间影响我十分大，我无法像那个悠闲的寒假一样看书找书，但书之外还有生活，我确定有一些东西在其中变化了，永久的改变了我一生的轨迹。

十二，卷土重来未可知 （2017.7-2017.12）
===
```md
当代数学精英(菲尔兹奖得主及其建树与见解)
数学奥林匹克试题背景研究
谐振仪 音乐数学原理的可视化向导
10000个科学难题（数学卷）
德国哲学十论
数学在19世纪的发展（第一卷）
HTML and CSS
机器人学、机器视觉与控制
Mathematica与大学物理计算
模拟电路设计手册
基于R语言的自动数据收集
魯拜集
数字设计和计算机体系结构
流形上的热核和分析
李白诗选
MATLAB数值计算
高等应用数学问题的MATLAB求解
与天为敌
第一行代码
清代禁書の研究
运筹学导论
A Course in Game Theory
量子力学
马尔可夫链：模型、算法与应用
剑指Offer
Hands-On Machine Learning with Scikit-Learn and TensorFlow
Principles and Practices of Interconnection Networks (The Morgan Kaufmann Series in Computer Architecture and Design)
Digital Design
数学在科学和社会中的作用
中国近代思想与学术的系谱
玻璃房
Elements of Information Theory
中国文化史
Probability Theory
法国大革命前的畅销禁书
燃燈者
程序员代码面试指南：IT名企算法与数据结构题目最优解
利用Python进行数据分析
测度论与概率论基础
钟与鼓
走向繁荣的战略选择
Statistical Mechanics
狮城舌战
哲学家的肚子
Elements de Geometrie Algebrique I
数学的统一性
差分方程的拉格朗日方法
Quantum Computation and Quantum Information
The Princeton Companion to Mathematics
凸优化
一瞥集
与光同尘
The Shape of Inner Space
代数几何
具体数学
琢石成器
C语言名题精选百则技巧篇
欧几里得空间的傅里叶分析
在历史中寻找中国
世界帝国史
这一代人的怕和爱
水浒后传
Algorithmic Game Theory
Algorithmics for Hard Problems
固体物理基础
基于AXI4的可编程SOC系统设计
小波与傅里叶分析基础
计算机组成与设计
FPGA设计指南
群论及其在固体物理中的应用
深入浅出数字信号处理
计算机系统要素
Verilog HDL数字设计与综合
Analysis and Design of Analog Integrated Circuits (4th Edition)
模拟CMOS集成电路设计
四人帮上海余党覆灭记
基于NI Multisim的电子电路计算机仿真设计与分析
基于运算放大器和模拟集成电路的电路设计
给青年诗人的信
算法图解
全国重点文物保护单位（全三卷）
杀死一个程序员
观察者的技术
穿越歧路花园
数学与泛型编程
中国共产党转型与中国的变迁
The SAGE Handbook of Historical Theory
地方性知识
巨变
游戏机制
```
明显的，我重新开始了自己对于学科的探索，与对于美好知识的追求，平平淡淡中有希望的日子已经过去了，一个人来到无数人曾经来到的海边，面对着无穷的壮美的这眼中一切，充满热情，野心勃勃。

书籍的梳理到此为止了，生活明天继续。

祝未来的自己可以做一些有意思、有价值的事情。

--2018.1.24 深夜
